---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
source: html/7db20bd9-6fba-bbd3-96ce-d08c0eec66c0.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData

The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryData : IDisposable
```

## Remarks
A FamilyInstance is the input data for the calculation,